## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 16 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         NAME                         |
|----------|------------------------------------------------------|
| update   | `aws_lambda_function.audit_logs`                     |
|          | `aws_lambda_function.form_archiver`                  |
|          | `aws_lambda_function.nagware`                        |
|          | `aws_lambda_function.reliability`                    |
|          | `aws_lambda_function.reliability_dlq_consumer`       |
|          | `aws_lambda_function.response_archiver`              |
|          | `aws_lambda_function.submission`                     |
|          | `aws_lambda_function.vault_integrity`                |
|          | `aws_s3_bucket_object.audit_logs_code`               |
|          | `aws_s3_bucket_object.form_archiver_code`            |
|          | `aws_s3_bucket_object.nagware_code`                  |
|          | `aws_s3_bucket_object.reliability_code`              |
|          | `aws_s3_bucket_object.reliability_dlq_consumer_code` |
|          | `aws_s3_bucket_object.response_archiver_code`        |
|          | `aws_s3_bucket_object.submission_code`               |
|          | `aws_s3_bucket_object.vault_integrity_code`          |
| recreate | `aws_signer_signing_job.vault_integrity[0]`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2023-12-07T21:57:09.701+0000" -> (known after apply)
      ~ s3_object_version              = "bM37xLRT6p5ihK7KubYGZzHJPrtjfIPS" -> (known after apply)
      ~ source_code_hash               = "x5SJ7CTgY2JIFjSyRxYr1HcG5bScn9ja+LnZsWgi8jo=" -> "HdzvpOCyQyAJVlXshAFgBi8Qps9TrQVN5lOFSXYtg9w="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "Archive_Form_Templates"
      ~ last_modified                  = "2023-12-07T21:57:15.481+0000" -> (known after apply)
      ~ s3_object_version              = "dl_LAehXv0uznhFX8Rwmy8Wh_E5lTeNE" -> (known after apply)
      ~ source_code_hash               = "RWnars63Zs7InDZ0Pr50eUoOn9ZG8giYVNm9f8YPWBQ=" -> "wzM5c3pyvj93a9Chl9ug+hLeJqU4G/V6yeRbhAAe7qQ="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2023-12-07T21:57:15.569+0000" -> (known after apply)
      ~ s3_object_version              = "iy31CnY0x2agioSYU9kSR9r2a5FydoAk" -> (known after apply)
      ~ source_code_hash               = "NFzL5S8FOQrLW/2U9okYV0oGSxEDZDoQDYlYjXQxENc=" -> "hcANTTOIyUdbt2mz5JOYz4mT0mXzcTlkIgN7rN2yHLg="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2023-12-07T21:57:10.185+0000" -> (known after apply)
      ~ s3_object_version              = "Hf5h9wbP60U5MPrLLbX0IieT5.wgPZU3" -> (known after apply)
      ~ source_code_hash               = "oF258lvU9QxLqi40WS5A1ObfsJe12GH6TmJ+4o0KlC8=" -> "UnEKZnSdJZQh8ych+IwWUC+csH24cnJrcyYCrBdfaww="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "Reliability_DLQ_Consumer"
      ~ last_modified                  = "2023-12-07T21:57:15.695+0000" -> (known after apply)
      ~ s3_object_version              = "hGSylNJytUzqEFUAgiEjESSfk_qB4p0T" -> (known after apply)
      ~ source_code_hash               = "e1yDlK1oZ8KmVX/jY5d2V+JTowKF0nC59/hUhNL5loY=" -> "UPZ+zG1tUaL9ra5BHnIZ4aQlSZdgJo7ILrYbFQKiKBU="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "Response_Archiver"
      ~ last_modified                  = "2023-12-07T21:57:15.821+0000" -> (known after apply)
      ~ s3_object_version              = "jDHG1UF0a43mIQQZ5erpZpMGVEXQW7KT" -> (known after apply)
      ~ source_code_hash               = "fd5QL4IygbLKEuyzf7KBqv4e9Lp3M/1G/EGM/HEgMPc=" -> "T/4TfGknaIjG13qyWW3cvAWYqCzVJ+kQfFos9YnQnJc="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2023-12-08T14:35:52.813+0000" -> (known after apply)
      ~ s3_object_version              = "tvuKQlHPlsLPHMWUgsvqLSDIBo_H_9Ju" -> (known after apply)
      ~ source_code_hash               = "QNxnOc/h2KEJ+R12mBmRG6n+md/76F8osz+vadvblPU=" -> "MyxtifUYfwAN5WWcl0w3cnNOAYE4kh5ax2OMKS55v6M="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2023-12-07T21:57:07.063+0000" -> (known after apply)
      ~ s3_bucket                      = "forms-staging-lambda-code" -> (known after apply)
      ~ s3_key                         = "signed/5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24" -> (known after apply)
      ~ source_code_hash               = "9opCvMNrZA+BCLvHUGkHDweCXfVwLgP5jcHfkTPLySc=" -> "eU+oOO3FFR6+K3MxeuUpSsIAcbOJWTo5qetHgYqq9BM="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "x5SJ7CTgY2JIFjSyRxYr1HcG5bScn9ja+LnZsWgi8jo=" -> "HdzvpOCyQyAJVlXshAFgBi8Qps9TrQVN5lOFSXYtg9w="
        tags                   = {}
      ~ version_id             = "bM37xLRT6p5ihK7KubYGZzHJPrtjfIPS" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.form_archiver_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "form_archiver_code" {
        id                     = "form_archiver_code"
      ~ source_hash            = "RWnars63Zs7InDZ0Pr50eUoOn9ZG8giYVNm9f8YPWBQ=" -> "wzM5c3pyvj93a9Chl9ug+hLeJqU4G/V6yeRbhAAe7qQ="
        tags                   = {}
      ~ version_id             = "dl_LAehXv0uznhFX8Rwmy8Wh_E5lTeNE" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.nagware_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "nagware_code" {
        id                     = "nagware_code"
      ~ source_hash            = "NFzL5S8FOQrLW/2U9okYV0oGSxEDZDoQDYlYjXQxENc=" -> "hcANTTOIyUdbt2mz5JOYz4mT0mXzcTlkIgN7rN2yHLg="
        tags                   = {}
      ~ version_id             = "iy31CnY0x2agioSYU9kSR9r2a5FydoAk" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.reliability_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "reliability_code" {
        id                     = "reliability_code"
      ~ source_hash            = "oF258lvU9QxLqi40WS5A1ObfsJe12GH6TmJ+4o0KlC8=" -> "UnEKZnSdJZQh8ych+IwWUC+csH24cnJrcyYCrBdfaww="
        tags                   = {}
      ~ version_id             = "Hf5h9wbP60U5MPrLLbX0IieT5.wgPZU3" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.reliability_dlq_consumer_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "reliability_dlq_consumer_code" {
        id                     = "reliability_dlq_consumer_code"
      ~ source_hash            = "e1yDlK1oZ8KmVX/jY5d2V+JTowKF0nC59/hUhNL5loY=" -> "UPZ+zG1tUaL9ra5BHnIZ4aQlSZdgJo7ILrYbFQKiKBU="
        tags                   = {}
      ~ version_id             = "hGSylNJytUzqEFUAgiEjESSfk_qB4p0T" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.response_archiver_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "response_archiver_code" {
        id                     = "response_archiver_code"
      ~ source_hash            = "fd5QL4IygbLKEuyzf7KBqv4e9Lp3M/1G/EGM/HEgMPc=" -> "T/4TfGknaIjG13qyWW3cvAWYqCzVJ+kQfFos9YnQnJc="
        tags                   = {}
      ~ version_id             = "jDHG1UF0a43mIQQZ5erpZpMGVEXQW7KT" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.submission_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "submission_code" {
        id                     = "submission_code"
      ~ source_hash            = "QNxnOc/h2KEJ+R12mBmRG6n+md/76F8osz+vadvblPU=" -> "MyxtifUYfwAN5WWcl0w3cnNOAYE4kh5ax2OMKS55v6M="
        tags                   = {}
      ~ version_id             = "tvuKQlHPlsLPHMWUgsvqLSDIBo_H_9Ju" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_bucket_object.vault_integrity_code will be updated in-place
  ~ resource "aws_s3_bucket_object" "vault_integrity_code" {
        id                     = "vault_integrity_code"
      ~ source_hash            = "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws=" -> "eU+oOO3FFR6+K3MxeuUpSsIAcbOJWTo5qetHgYqq9BM="
        tags                   = {}
      ~ version_id             = "sQTR1bM5TctBB1gnxGI5GNQx3fnc7zbN" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_signer_signing_job.vault_integrity[0] must be replaced
-/+ resource "aws_signer_signing_job" "vault_integrity" {
      ~ completed_at               = "2023-12-07T21:57:02Z" -> (known after apply)
      ~ created_at                 = "2023-12-07T21:57:00Z" -> (known after apply)
      ~ id                         = "5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24" -> (known after apply)
      ~ job_id                     = "5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24" -> (known after apply)
      ~ job_invoker                = "687401027353" -> (known after apply)
      ~ job_owner                  = "687401027353" -> (known after apply)
      ~ platform_display_name      = "AWS Lambda" -> (known after apply)
      ~ platform_id                = "AWSLambda-SHA384-ECDSA" -> (known after apply)
      ~ profile_version            = "3cak3nO7rT" -> (known after apply)
      ~ requested_by               = "arn:aws:iam::687401027353:user/GitHub_Terraform" -> (known after apply)
      ~ revocation_record          = [] -> (known after apply)
      ~ signature_expires_at       = "2035-03-07T21:57:02Z" -> (known after apply)
      ~ signed_object              = [
          - {
              - s3 = [
                  - {
                      - bucket = "forms-staging-lambda-code"
                      - key    = "signed/5fb02f2a-e7d7-43c0-bb98-aeaf9f2a6f24"
                    },
                ]
            },
        ] -> (known after apply)
      ~ status                     = "Succeeded" -> (known after apply)
      ~ status_reason              = "Signing Succeeded" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          ~ s3 {
              ~ version = "sQTR1bM5TctBB1gnxGI5GNQx3fnc7zbN" # forces replacement -> (known after apply) # forces replacement
                # (2 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 16 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.audit_logs_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.form_archiver_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.nagware_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.reliability_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.reliability_dlq_consumer_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.response_archiver_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.submission_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.vault_integrity_code"]
WARN - plan.json - main - Missing Common Tags: ["aws_signer_signing_profile.lambda_signing_profile[0]"]

40 tests, 19 passed, 21 warnings, 0...
```

</details>
